OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/inc/stm8l15x_tim2.h
/**
  ******************************************************************************
  * @file    stm8l15x_tim2.h
  * @author  MCD Application Team
  * @version V1.6.1
  * @date    30-September-2014
  * @brief   This file contains all the functions prototypes for the TIM2 firmware
  *          library.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************  
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM8L15x_TIM2_H
#define __STM8L15x_TIM2_H


/* Includes ------------------------------------------------------------------*/
#include "stm8l15x.h"

/** @addtogroup STM8L15x_StdPeriph_Driver
  * @{
  */
  
/** @addtogroup TIM2
  * @{
  */
   
/* Exported types ------------------------------------------------------------*/

/** @defgroup TIM2_Exported_Types
  * @{
  */

/** @defgroup TIM2_Forced_Action
  * @{
  */
typedef enum
{
  TIM2_ForcedAction_Active   = ((uint8_t)0x50),   /*!< Output Reference is forced low */
  TIM2_ForcedAction_Inactive = ((uint8_t)0x40)    /*!< Output Reference is forced high */
}
TIM2_ForcedAction_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Prescaler
  * @{
  */
typedef enum
{
  TIM2_Prescaler_1     = ((uint8_t)0x00),   /*!< Time base Prescaler = 1 (No effect)*/
  TIM2_Prescaler_2     = ((uint8_t)0x01),   /*!< Time base Prescaler = 2 */
  TIM2_Prescaler_4     = ((uint8_t)0x02),   /*!< Time base Prescaler = 4 */
  TIM2_Prescaler_8     = ((uint8_t)0x03),   /*!< Time base Prescaler = 8 */
  TIM2_Prescaler_16    = ((uint8_t)0x04),   /*!< Time base Prescaler = 16 */
  TIM2_Prescaler_32    = ((uint8_t)0x05),   /*!< Time base Prescaler = 32 */
  TIM2_Prescaler_64    = ((uint8_t)0x06),   /*!< Time base Prescaler = 64 */
  TIM2_Prescaler_128   = ((uint8_t)0x07)    /*!< Time base Prescaler = 128 */
}TIM2_Prescaler_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_OCMode
  * @{
  */
typedef enum
{
  TIM2_OCMode_Timing    = ((uint8_t)0x00),   /*!< Timing (Frozen) Mode*/
  TIM2_OCMode_Active    = ((uint8_t)0x10),   /*!< Active Mode*/
  TIM2_OCMode_Inactive  = ((uint8_t)0x20),   /*!< Inactive Mode*/
  TIM2_OCMode_Toggle    = ((uint8_t)0x30),   /*!< Toggle Mode*/
  TIM2_OCMode_PWM1      = ((uint8_t)0x60),   /*!< PWM Mode 1*/
  TIM2_OCMode_PWM2      = ((uint8_t)0x70)    /*!< PWM Mode 2*/
}TIM2_OCMode_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_OnePulseMode
  * @{
  */
typedef enum
{
  TIM2_OPMode_Single      = ((uint8_t)0x01), /*!< Single one Pulse mode (OPM Active) */
  TIM2_OPMode_Repetitive  = ((uint8_t)0x00)  /*!< Repetitive Pulse mode (OPM inactive) */
}TIM2_OPMode_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Channel
  * @{
  */
typedef enum
{
  TIM2_Channel_1  = ((uint8_t)0x00),  /*!< Channel 1*/
  TIM2_Channel_2  = ((uint8_t)0x01)   /*!< Channel 2*/
}TIM2_Channel_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_CounterMode
  * @{
  */
typedef enum
{
  TIM2_CounterMode_Up               = ((uint8_t)0x00),   /*!< Counter Up Mode */
  TIM2_CounterMode_Down             = ((uint8_t)0x10),   /*!< Counter Down Mode */
  TIM2_CounterMode_CenterAligned1   = ((uint8_t)0x20),   /*!< Counter Central aligned Mode 1 */
  TIM2_CounterMode_CenterAligned2   = ((uint8_t)0x40),   /*!< Counter Central aligned Mode 2 */
  TIM2_CounterMode_CenterAligned3   = ((uint8_t)0x60)    /*!< Counter Central aligned Mode 3 */
}TIM2_CounterMode_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Output_Compare_Polarity
  * @{
  */
typedef enum
{
  TIM2_OCPolarity_High   = ((uint8_t)0x00),   /*!< Output compare polarity  = High */
  TIM2_OCPolarity_Low    = ((uint8_t)0x01)    /*!< Output compare polarity  = Low */
}TIM2_OCPolarity_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Output_State
  * @{
  */
typedef enum
{
  TIM2_OutputState_Disable   = ((uint8_t)0x00),   /*!< Output compare State disabled (channel output disabled) */
  TIM2_OutputState_Enable    = ((uint8_t)0x01)    /*!< Output compare State enabled (channel output enabled) */
}TIM2_OutputState_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Break_State
  * @{
  */
typedef enum
{
  TIM2_BreakState_Disable  = ((uint8_t)0x00),   /*!< Break State disabled (break option disabled) */
  TIM2_BreakState_Enable   = ((uint8_t)0x10)    /*!< Break State enabled (break option enabled) */

}TIM2_BreakState_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Break_Polarity
  * @{
  */
typedef enum
{
  TIM2_BreakPolarity_High  = ((uint8_t)0x20),  /*!< if Break, channel polarity = High */
  TIM2_BreakPolarity_Low   = ((uint8_t)0x00)   /*!< if Break, channel polarity = Low */

}TIM2_BreakPolarity_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Automatic_Output
  * @{
  */  
typedef enum
{
  TIM2_AutomaticOutput_Enable    = ((uint8_t)0x40),   /*!< Automatic Output option enabled */
  TIM2_AutomaticOutput_Disable   = ((uint8_t)0x00)    /*!< Automatic Output option disabled */
}TIM2_AutomaticOutput_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_Lock_Level
  * @{
  */
typedef enum
{
  TIM2_LockLevel_Off  = ((uint8_t)0x00),   /*!< Lock option disabled */
  TIM2_LockLevel_1    = ((uint8_t)0x01),   /*!< Select Lock Level 1  */
  TIM2_LockLevel_2    = ((uint8_t)0x02),   /*!< Select Lock Level 2  */
  TIM2_LockLevel_3    = ((uint8_t)0x03)    /*!< Select Lock Level 3  */
}TIM2_LockLevel_TypeDef;

/**
  * @}
  */
  
/** @defgroup TIM2_OSSI_State
  * @{
  */
typedef enum
{
  TIM2_OSSIState_Enable    = ((uint8_t)0x04),   /*!< Off-State Selection for Idle mode enabled  */
  TIM2_OSSIState_Disable   = ((uint8_t)0x00)    /*!< Off-State Selection for Idle mode disabled  */
}TIM2_OSSIState_TypeDef;

/**
  * @}
  */
  
